# WinderRunWidthLessThan2TimesMinWidthFailure Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..WinderRunWidthLessThan2TimesMinWidthFailure Property
BuiltInFailures..::..StairRampFailures Class See Also
---
The value for Minimum Width on Inside Boundary is too large to satisfy the number of Parallel Treads at the Start or End as specified in the Run Instance properties.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId WinderRunWidthLessThan2TimesMinWidthFailure { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WinderRunWidthLessThan2TimesMinWidthFailure As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ WinderRunWidthLessThan2TimesMinWidthFailure {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace